SunCity/src/ExchangePlans/ОбменРозницаУправлениеТорговымПредприятием/ОбменРозницаУправлениеТорговымПредприятием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="baf336b6-12f2-48b9-aebd-bd3aa2a6fd2b">
  <name>ОбменРозницаУправлениеТорговымПредприятием</name>
  <comment>Синхронизация данных между конфигурациями &quot;Розница для Казахстана&quot; и &quot;Управление торговым предприятием для Казахстана 2.0&quot;</comment>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоСкладам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыгружатьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

SunCity/src/Enums/РежимыВыгрузкиОбъектовОбмена/РежимыВыгрузкиОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыВыгрузкиОбъектовОбмена</name>
  <enumValues>
    <name>ВыгружатьВсегда</name>
    <comment>Выгрузка без использования фильтров</comment>
  </enumValues>
  <enumValues>
    <name>ВыгружатьПоУсловию</name>
    <comment>Выгрузка с использованием фильтров</comment>
  </enumValues>
  <enumValues>
    <name>ВыгружатьПриНеобходимости</name>
    <comment>Выгрузка без использования фильтров, но с контролем ссылочной целостности выгружаемых данных</comment>
  </enumValues>
  <enumValues>
    <name>ВыгружатьВручную</name>
    <comment>В этом режиме изменения объектов не регистрируются автоматически (через подписки на события); объекты регистрируются к выгрузке вручную пользователем и выгружаются только, если соответствуют фильтру, установленному на узле, для которого выполняется выгруз</comment>
  </enumValues>
  <enumValues>
    <name>НеВыгружать</name>
    <comment>В этом режиме изменения объектов не регистрируются автоматически (через подписки на события) и не выгружаются, даже если изменения объектов были зарегистрированы вручную пользователем.</comment>
  </enumValues>
</mdclass:Enum>

SunCity/src/ExchangePlans/ОбменРозницаУправлениеТорговымПредприятием/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ИспользоватьОтборПоОрганизациям Тогда
		Организации.Очистить();
	КонецЕсли;
	Если НЕ ИспользоватьОтборПоСкладам Тогда
		Склады.Очистить();
	КонецЕсли;
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;

	Если ЭтоНовый() Тогда
		Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Истина);
	Иначе
		Если ПометкаУдаления Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	УзлыОбмена.Ссылка
			|ИЗ
			|	ПланОбмена.ОбменРозницаУправлениеТорговымПредприятием КАК УзлыОбмена
			|ГДЕ
			|	УзлыОбмена.Ссылка <> &ЭтотУзел
			|	И УзлыОбмена.Ссылка <> &Ссылка
			|	И (НЕ УзлыОбмена.ПометкаУдаления)");
			Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменРозницаУправлениеТорговымПредприятием.ЭтотУзел());
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Ложь);
			КонецЕсли;
		Иначе
			Если НЕ Константы.ИспользуетсяОбменСУправлениемТорговлей.Получить() Тогда
				Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьОбъект(ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением".
//
Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	УзлыОбмена.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменРозницаУправлениеТорговымПредприятием КАК УзлыОбмена
	|ГДЕ
	|	УзлыОбмена.Ссылка <> &ЭтотУзел
	|	И УзлыОбмена.Ссылка <> &Ссылка
	|	И (НЕ УзлыОбмена.ПометкаУдаления)");
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменРозницаУправлениеТорговымПредприятием.ЭтотУзел());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОбъект(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаВыгрузкиДокументов	= НачалоГода(ТекущаяДатаСеанса());
	РежимВыгрузкиПриНеобходимости 	= Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
